lab2-soap/dsgt-soap/requestorder.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gs="http://foodmenu.io/gt/webservice">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:addOrderRequest>
            <gs:order>
                <gs:address>Celestijnenlaan 200, 3001 Leuven</gs:address>
                <gs:meals>Steak</gs:meals>
                <gs:meals>Portobello</gs:meals>
            </gs:order>
        </gs:addOrderRequest>
    </soapenv:Body>
</soapenv:Envelope>